/************************************************************************************
 *
 *   程序名称：历史命令的查询
 *   设计编写：rainhenry
 *   程序版本：REV 0.1
 *   最后修改：20191115
 *
 ***********************************************************************************/
//-----------------------------------------------------------------------------------
//  重定义保护
#ifndef __CMD_HISTORY_H__
#define __CMD_HISTORY_H__

//-----------------------------------------------------------------------------------
//  包含头文件

//-----------------------------------------------------------------------------------
//  C++兼容处理
#ifdef __cplusplus
extern "C"
{
#endif

//-----------------------------------------------------------------------------------
//  相关宏定义

//-----------------------------------------------------------------------------------
//  定义相关数据类型

//-----------------------------------------------------------------------------------
//  导出函数

//  复位命令历史相关
void CmdHistory_Init(void);

//  获取当前存在的历史命令数量
int CmdHistory_GetHistoryNum(void);

//  插入一个命令
void CmdHistory_InsertNewCmd(char* cmd_str);

//  获取倒数第n个命令的字符串地址指针
//  成功返回字符串指针，失败返回0指针
//  输入的n表示时间顺序最近的一个，0基序
char* CmdHistory_GetCmdStringByN(int n);

//  历史向上  1=调用成功  0=调用失败
int CmdHistory_HistoryUp(void);

//  历史向下  1=调用成功  0=调用失败
int CmdHistory_HistoryDown(void);

//  获取当前历史的内容  成功返回历史命令字符串首地址， 失败返回0指针
char* CmdHistory_GetHistoryCurStr(void);

//  清除历史位置，用于回车调用
void CmdHistory_CleanHistoryPos(void);

//-----------------------------------------------------------------------------------
//  C++兼容处理
#ifdef __cplusplus
}
#endif

//-----------------------------------------------------------------------------------
#endif  //  __CMD_HISTORY_H__
