/************************************************************************************
 *
 *   程序名称：基于单片机的Shell命令行处理程序，支持VT100协议终端登录
 *   设计编写：rainhenry
 *   程序版本：REV 0.1
 *   最后修改：20191116
 *
 *   版本修订
 *     REV 0.1   20191116   rainhenry     创建文档
 *
 *   基本功能
 *     在单片机上实现基于VT100协议的shell终端脚本解释器，内建help命令和history命令，支持上下键的历史查看
 *   支持F1到F12的功能键，建议一般用于日志打印级别的控制
 *
 *   使用说明
 *   1）实现串口硬件的发送回调函数     即VT100。c文件中的VT100_SEND_TO_PHY_DEVICE函数
 *   2）当串口收到数据时，请调用VT100.c文件中的VT100_InsertRecvBuf函数，并将收到的数据传入进去
 *   3）初始化的请调用shell.c中的ShellCmd_Init函数
 *   4）当所有硬件和条件准备好后，可以调用shell.c中的ShellCmd_ShellBegin函数开始脚本解释器的运行
 *   5）整个脚本解释器需要在主循环中轮询调用VT100.c中的VT100_RecvHandle函数
 *
 *   6）如果有自定义的用户命令需要添加，请修改user_cmd.c中的UserCmdBuf常亮命令列表，相关命令的执行函数需要用户自行定义
 *   7）所有相关命令的执行，一旦命令解释成功，都由VT100.c中的VT100_RecvHandle函数发起调用用户命令的执行函数
 *   8）连接串口后推荐使用putty软件进行shell终端操作，因为这个不是普通的ASCII串口，而是VT100协议的终端
 *   9）凡是用到这个代码的地方，就包含本头文件即可
 *
 *   设计参考
 *     [1]  https://www.vt100.net/
 *     [2]  http://www.termsys.demon.co.uk/vtansi.htm
 *
 *   相关链接
 *     1) putty下载地址  https://www.putty.org/
 *
 ***********************************************************************************/
//-----------------------------------------------------------------------------------
//  重定义保护
#ifndef __MCU_SHELL_H__
#define __MCU_SHELL_H__

//-----------------------------------------------------------------------------------
//  包含头文件
#include "VT100.h"
#include "shell.h"
#include "user_cmd.h"
#include "cmd_history.h"

//-----------------------------------------------------------------------------------
//  C++兼容处理
#ifdef __cplusplus
extern "C"
{
#endif

//-----------------------------------------------------------------------------------
//  相关宏定义
//  shell解释器相关配置
#define SHELL_CMD_HEAD_STR                  "root# "       //  shell解释器的头部前缀字符串
#define SHELL_CMD_MAX_CHAR                      100        //  一行命令支持最多的字符

//  VT100虚拟终端相关配置
#define VT100_RECV_BUF_SIZE                     100        //  接收缓冲区大小
#define VT100_RECV_HINT_TAB_NUM                   2        //  定义触发提示的TAB按下次数
#define VT100_PRINTF_EN                           1        //  是否开启VT100下面的printf功能   0为关闭  1为开启
#define VT100_PRINTF_BUFSIZE                    100        //  VT100下面的printf使用的缓冲区大小

//  历史命令相关配置
#define CMD_HISTORY_EN                            1        //  是否开启历史命令功能   0为关闭  1为开启
#define CMD_HISTORY_NUM_MAX                       5        //  历史命令的缓冲区大小，该值为n时，所能存储的历史命令个数为(n-1)个
#define CMD_HISTORY_STR                   "history"        //  内建历史命令的关键字

//-----------------------------------------------------------------------------------
//  C++兼容处理
#ifdef __cplusplus
}
#endif

//-----------------------------------------------------------------------------------
#endif  //  __MCU_SHELL_H__
